bench_bnb/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "4VrmBgOylousqt_9oYGUZA"], ["updated_at", "2018-12-07 23:26:05.030739"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = generate_session_token
        self.save!

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "miso"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
        user = User.find_by_username(username)